app/controllers/produtos_controller.rb

    def index
        @produtos_por_nome = Produto.order(:nome).limit 5
        @produtos_por_preco = Produto.order(:preco).limit 2
---
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC LIMIT ?  [["LIMIT", 5]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 2]]

    def create
        @produto = Produto.new produto_params
        if @produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "quantidade", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Camiseta Azul"], ["descricao", "Camiseta Azul"], ["quantidade", 30], ["preco", 30.0], ["created_at", "2018-03-13 19:29:20.696696"], ["updated_at", "2018-03-13 19:29:20.696696"]]

    def busca
        @nome_a_buscar = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome_a_buscar}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like '%DFESER%')

    def update
        if @produto.update produto_params
---
UPDATE "produtos" SET "nome" = ?, "descricao" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["nome", "Bermuda Big Bang Theory"], ["descricao", "Bermuda Big Bang Theory"], ["updated_at", "2018-03-14 17:09:29.678126"], ["id", 3]]

    def set_produto
        id = params[:id]
        @produto = Produto.find(params[:id])
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]